In [1]:
import pandas as pd
import numpy as np

# Endpoint 1

In [3]:
df_f1 = pd.read_csv('Data/Funcion_1_Query_1.csv')

In [4]:
# Se encuentra los índices de las filas con el mayor valor de 'Playtime' para cada 'Genero'
max_playtime_indices = df_f1.groupby('Gen')['Playtime'].idxmax()

# Selecciona las filas correspondientes a esos índices y se vierten en un nuevo DF
df_f1_v2 = df_f1.loc[max_playtime_indices]

In [5]:
df_f1_v2.reset_index(drop=True)

                   Gen  Year    Playtime
0                1980s  2015       24057
1              1990s""  2011      173548
2                   2D  2012      168599
3        3D Platformer  2011      173548
4               Action  2012  1099231451
..                 ...   ...         ...
127  Walking Simulator  2015           2
128     Web Publishing  2012     1947406
129        World War I  2016           0
130            Zombies  2015        2730
131           e-sports  2014      451933

[132 rows x 3 columns]

In [6]:
print(len(df_f1_v2))
print(df_f1_v2.isnull().sum())
print(df_f1_v2['Gen'].duplicated().sum())

132
Gen         0
Year        0
Playtime    0
dtype: int64
0

In [7]:
df_f1_v3 = df_f1_v2.copy()

df_f1_v3['Gen'].astype(str)
df_f1_v3['Year'].astype(str)
df_f1_v3['Playtime'].astype(int)

134         24057
294        173548
270        168599
309        173548
248    1099231451
          ...
157             2
278       1947406
78              0
139          2730
195        451933
Name: Playtime, Length: 132, dtype: int32

In [8]:
# Remover los caracteres "
df_f1_v3['Gen'] = df_f1_v3['Gen'].str.replace('"', '')

# Reemplazar &amp; con NaN y luego propagar hacia adelante los valores no nulos
df_f1_v3['Gen'] = df_f1_v3['Gen'].str.replace('&amp;', '&', regex=True)

In [9]:
# Fusionar los duplicados de "Gen" y sumar los valores de "Playtime"
df_f1_v4 = df_f1_v3.groupby('Gen', as_index=False).agg({'Year': 'first', 'Playtime': 'sum'})

In [10]:
df_f1_v4.head(5)

             Gen  Year    Playtime
0          1980s  2015       24057
1          1990s  2011      173548
2             2D  2012      168599
3  3D Platformer  2011      173548
4         Action  2012  1099231451

In [11]:
print(len(df_f1_v4))
print(df_f1_v4.isnull().sum())
print(df_f1_v4['Gen'].duplicated().sum())

130
Gen         0
Year        0
Playtime    0
dtype: int64
0

In [15]:
df_f1_v5 = df_f1_v4.copy()

In [16]:
df_f1_v5['Mensaje'] = (
    'Año de lanzamiento con más horas jugadas para Género ' +
    df_f1_v4['Gen'] + ': ' + df_f1_v4['Year'].astype(str)
)

In [17]:
df_f1_v5['Mensaje'][0]

'Año de lanzamiento con más horas jugadas para Género 1980s: 2015'

In [18]:
df_f1_v5.columns

Index(['Gen', 'Year', 'Playtime', 'Mensaje'], dtype='object')

In [20]:
df_f1_final = df_f1_v5.drop(['Playtime','Year'], axis=1)

In [21]:
df_f1_final.head()

             Gen                                            Mensaje
0          1980s  Año de lanzamiento con más horas jugadas para ...
1          1990s  Año de lanzamiento con más horas jugadas para ...
2             2D  Año de lanzamiento con más horas jugadas para ...
3  3D Platformer  Año de lanzamiento con más horas jugadas para ...
4         Action  Año de lanzamiento con más horas jugadas para ...

In [22]:
df_f1_final['Mensaje'][0]

'Año de lanzamiento con más horas jugadas para Género 1980s: 2015'

In [26]:
df_f1_final.to_csv('Data/Endpoints/Endpoint_1.csv', index=False)

# Endpoint 2

In [28]:
df_f2 = pd.read_csv('Data\Funcion_2_Query_1.csv')

In [29]:
print(len(df_f2))
print(df_f2.isnull().sum())
df_f2.head()

132
Genero      0
usuario     0
Playtime    0
dtype: int64

          Genero            usuario  Playtime
0        1990s""  76561197995146150     15942
1          1980s  76561198042170355     10467
2             2D  76561198083612270     24664
3  3D Platformer  76561197995146150     15820
4         Action            Sp3ctre   1697651

In [30]:
# Remover los caracteres "
df_f2['Genero'] = df_f2['Genero'].str.replace('"', '')

# Reemplazar &amp; con NaN y luego propagar hacia adelante los valores no nulos
df_f2['Genero'] = df_f2['Genero'].str.replace('&amp;', '&', regex=True)

In [31]:
print(len(df_f2))
print(df_f2.isnull().sum())
print(df_f2['Genero'].duplicated().sum())

132
Genero      0
usuario     0
Playtime    0
dtype: int64
2

In [32]:
df_f2_v2 = df_f2.copy()

In [33]:
# Se eliminan los duplicados en la columna 'Genero'

df_f2_v2 = df_f2_v2.drop_duplicates(subset='Genero', keep='last')

In [34]:
print(len(df_f2_v2))
print(df_f2_v2.isnull().sum())
print(df_f2_v2['Genero'].duplicated().sum())
df_f2_v2.head()

130
Genero      0
usuario     0
Playtime    0
dtype: int64
0

          Genero            usuario  Playtime
0          1990s  76561197995146150     15942
1          1980s  76561198042170355     10467
2             2D  76561198083612270     24664
3  3D Platformer  76561197995146150     15820
4         Action            Sp3ctre   1697651

In [35]:
df_f2_v3 = df_f2_v2.copy()

In [36]:
df_f2_v3 = df_f2_v3.drop(['Playtime'], axis=1)

df_f2_v3 = df_f2_v3.rename(columns={'usuario': 'user_id'})

In [37]:
print(len(df_f2_v3))
print(df_f2_v3.isnull().sum())
print(df_f2_v3.columns)

130
Genero     0
user_id    0
dtype: int64
Index(['Genero', 'user_id'], dtype='object')

In [41]:
df_iq_f2 = pd.read_csv('Data\data_Items.csv')

In [42]:
print(len(df_iq_f2))
print(df_iq_f2.isnull().sum())
print(df_iq_f2.columns)

5153209
item_id             0
item_name           0
playtime_forever    0
user_id             0
items_count         0
dtype: int64
Index(['item_id', 'item_name', 'playtime_forever', 'user_id', 'items_count'], dtype='object')

In [43]:
df_iq_f2 = df_iq_f2.drop(['items_count', 'item_name'], axis=1)

In [44]:
df_iq_f2.columns

Index(['item_id', 'playtime_forever', 'user_id'], dtype='object')

In [45]:
df_f2_v4 = pd.merge(df_f2_v3, df_iq_f2, on='user_id', how='inner')

In [46]:
print(len(df_f2_v4))
print(df_f2_v4.isnull().sum())
print(df_f2_v4.columns)

68471
Genero              0
user_id             0
item_id             0
playtime_forever    0
dtype: int64
Index(['Genero', 'user_id', 'item_id', 'playtime_forever'], dtype='object')

In [47]:
df_f2_v4.head(5)

  Genero            user_id  item_id  playtime_forever
0  1990s  76561197995146150       10                 0
1  1990s  76561197995146150       80                 0
2  1990s  76561197995146150      100                 0
3  1990s  76561197995146150       20              2124
4  1990s  76561197995146150       50                 0

In [48]:
filtered_df = df_f2_v4[df_f2_v4['user_id'] == '76561197995146150']

In [49]:
filtered_df['Genero'].value_counts()

Genero
1990s                 342
3D Platformer         342
Anime                 342
Classic               342
Controller            342
Female Protagonist    342
Memes                 342
Open World            342
Replay Value          342
Retro                 342
Story Rich            342
Third Person          342
Name: count, dtype: int64

In [50]:
df_f2_v5 = df_f2_v4[df_f2_v4['playtime_forever'] != 0]

In [51]:
df_f2_v5.reset_index(drop=True)

print(len(df_f2_v5))
print(df_f2_v5.isnull().sum())
print(df_f2_v5.columns)
df_f2_v5.head(5)

33760
Genero              0
user_id             0
item_id             0
playtime_forever    0
dtype: int64
Index(['Genero', 'user_id', 'item_id', 'playtime_forever'], dtype='object')

   Genero            user_id  item_id  playtime_forever
3   1990s  76561197995146150       20              2124
5   1990s  76561197995146150       70                 1
9   1990s  76561197995146150      320                 8
10  1990s  76561197995146150      340              3011
12  1990s  76561197995146150      380             25209

In [52]:
df_grd_f2 = pd.read_csv('Data\data_Steam_1.csv')

In [53]:
print(len(df_grd_f2))
print(df_grd_f2.isnull().sum())
print(df_grd_f2.columns)

74500
genres          0
release_date    0
id              0
dtype: int64
Index(['genres', 'release_date', 'id'], dtype='object')

In [54]:
df_grd_f2 = df_grd_f2.rename(columns={'id': 'item_id'})

In [55]:
df_grd_f2.columns

Index(['genres', 'release_date', 'item_id'], dtype='object')

In [56]:
df_f2_v5.reset_index(drop=True)
df_grd_f2.reset_index(drop=True)

           genres  release_date  item_id
0          Action          2018   761140
1          Casual          2018   761140
2           Indie          2018   761140
3      Simulation          2018   761140
4        Strategy          2018   761140
...           ...           ...      ...
74495       Indie          2018   610660
74496      Racing          2018   610660
74497  Simulation          2018   610660
74498      Casual          2017   658870
74499       Indie          2017   658870

[74500 rows x 3 columns]

In [57]:
df_f2_v6 = pd.merge(df_f2_v5, df_grd_f2, on='item_id', how='left')

In [58]:
print(len(df_f2_v6))
print(df_f2_v6.isnull().sum())
print(df_f2_v6.columns)
df_f2_v6.head()

78147
Genero                 0
user_id                0
item_id                0
playtime_forever       0
genres              3898
release_date        3898
dtype: int64
Index(['Genero', 'user_id', 'item_id', 'playtime_forever', 'genres',
       'release_date'],
      dtype='object')

  Genero            user_id  item_id  playtime_forever  genres  release_date
0  1990s  76561197995146150       20              2124  Action        1999.0
1  1990s  76561197995146150       70                 1  Action        1998.0
2  1990s  76561197995146150      320                 8  Action        2004.0
3  1990s  76561197995146150      340              3011  Action        2005.0
4  1990s  76561197995146150      380             25209  Action        2006.0

In [59]:
df_f2_v7 = df_f2_v6.copy()

In [60]:
# Remover los caracteres "
df_f2_v7['genres'] = df_f2_v7['genres'].str.replace('"', '')

# Reemplazar &amp; con NaN y luego propagar hacia adelante los valores no nulos
df_f2_v7['genres'] = df_f2_v7['genres'].str.replace('&amp;', '&', regex=True)

In [61]:
print(len(df_f2_v7))
print(df_f2_v7.isnull().sum())
print(df_f2_v7.columns)
df_f2_v7.head()

78147
Genero                 0
user_id                0
item_id                0
playtime_forever       0
genres              3898
release_date        3898
dtype: int64
Index(['Genero', 'user_id', 'item_id', 'playtime_forever', 'genres',
       'release_date'],
      dtype='object')

  Genero            user_id  item_id  playtime_forever  genres  release_date
0  1990s  76561197995146150       20              2124  Action        1999.0
1  1990s  76561197995146150       70                 1  Action        1998.0
2  1990s  76561197995146150      320                 8  Action        2004.0
3  1990s  76561197995146150      340              3011  Action        2005.0
4  1990s  76561197995146150      380             25209  Action        2006.0

In [62]:
df_f2_v8 = df_f2_v7[df_f2_v7['Genero'] == df_f2_v7['genres']]

In [63]:
print(len(df_f2_v8))
print(df_f2_v8.isnull().sum())
print(df_f2_v8.columns)
df_f2_v8.head()

2041
Genero              0
user_id             0
item_id             0
playtime_forever    0
genres              0
release_date        0
dtype: int64
Index(['Genero', 'user_id', 'item_id', 'playtime_forever', 'genres',
       'release_date'],
      dtype='object')

,Genero,user_id,item_id,playtime_forever,genres,release_date
41,1990s,76561197995146150,71250,15820,1990s,2011.0
66,1990s,76561197995146150,200940,122,1990s,2012.0
178,3D Platformer,76561197995146150,71250,15820,3D Platformer,2011.0
348,Anime,76561197995146150,71250,15820,Anime,2011.0
382,Anime,76561197995146150,200940,122,Anime,2012.0

In [64]:
print(len(df_f2_v2))
print(df_f2_v2.isnull().sum())
print(df_f2_v2.columns)
df_f2_v2.head()

130
Genero      0
usuario     0
Playtime    0
dtype: int64
Index(['Genero', 'usuario', 'Playtime'], dtype='object')

          Genero            usuario  Playtime
0          1990s  76561197995146150     15942
1          1980s  76561198042170355     10467
2             2D  76561198083612270     24664
3  3D Platformer  76561197995146150     15820
4         Action            Sp3ctre   1697651

In [65]:
df_f2_v2.astype(str)
df_f2_v8.astype(str)

,Genero,user_id,item_id,playtime_forever,genres,release_date
41,1990s,76561197995146150,71250,15820,1990s,2011.0
66,1990s,76561197995146150,200940,122,1990s,2012.0
178,3D Platformer,76561197995146150,71250,15820,3D Platformer,2011.0
348,Anime,76561197995146150,71250,15820,Anime,2011.0
382,Anime,76561197995146150,200940,122,Anime,2012.0
...,...,...,...,...,...,...
77636,Utilities,76561198073642113,268850,207651,Utilities,2014.0
77845,Walking Simulator,76561198049268659,371240,2,Walking Simulator,2015.0
77939,Web Publishing,Xyphien,220700,64657,Web Publishing,2012.0
78023,Web Publishing,Xyphien,235900,7296,Web Publishing,2005.0
78112,Web Publishing,Xyphien,363890,71011,Web Publishing,2015.0

In [66]:
df_f2_v2_2 = df_f2_v2.copy()

In [67]:
# Función para filtrar df_f2_v8 según los valores de df_f2_v2
def filter_dataframe(row):
    filtered_rows = df_f2_v8[
        (df_f2_v8['Genero'] == row['Genero']) &
        (df_f2_v8['user_id'] == row['usuario'])
    ]
    return filtered_rows

In [68]:
# Aplicar la función por filas de df_f2_v2
filtered_rows = df_f2_v2_2.apply(filter_dataframe, axis=1)

In [69]:
# Concatenar las listas de DataFrames resultantes
df_f2_v10 = pd.concat(filtered_rows.tolist(), ignore_index=True)

In [70]:
print(len(df_f2_v10))
print(df_f2_v10.isnull().sum())
print(df_f2_v10.columns)
df_f2_v10.head()

2041
Genero              0
user_id             0
item_id             0
playtime_forever    0
genres              0
release_date        0
dtype: int64
Index(['Genero', 'user_id', 'item_id', 'playtime_forever', 'genres',
       'release_date'],
      dtype='object')

  Genero            user_id  item_id  playtime_forever genres  release_date
0  1990s  76561197995146150    71250             15820  1990s        2011.0
1  1990s  76561197995146150   200940               122  1990s        2012.0
2  1980s  76561198042170355   374570             10467  1980s        2015.0
3     2D  76561198083612270   200940               117     2D        2012.0
4     2D  76561198083612270   202530             24547     2D        2012.0

In [71]:
def create_message(group):
    mensaje = f"Usuario con más horas jugadas para Género {group['Genero'].iloc[0]} : {group['user_id'].iloc[0]}, Horas jugadas: año {group['release_date'].iloc[0]}, {group['playtime_forever'].iloc[0]}"

    if len(group) > 1:
        for i in range(1, len(group)):
            mensaje += f", año {group['release_date'].iloc[i]}, {group['playtime_forever'].iloc[i]}"
    return mensaje

In [72]:
df_f2_v11 = df_f2_v10.groupby('Genero').apply(create_message).reset_index(name='mensaje')

In [73]:
print(len(df_f2_v11))
print(df_f2_v11.isnull().sum())
print(df_f2_v11.columns)
df_f2_v11.head()

122
Genero     0
mensaje    0
dtype: int64
Index(['Genero', 'mensaje'], dtype='object')

          Genero                                            mensaje
0          1980s  Usuario con más horas jugadas para Género 1980...
1          1990s  Usuario con más horas jugadas para Género 1990...
2             2D  Usuario con más horas jugadas para Género 2D :...
3  3D Platformer  Usuario con más horas jugadas para Género 3D P...
4         Action  Usuario con más horas jugadas para Género Acti...

In [556]:
df_f2_v11.to_csv('Data\Endpoints\Endpoint_2.csv', index=False)

# Endpoint 3

In [74]:
df_f3_v1 = pd.read_csv('Data\data_NLPM_2.csv')

In [75]:
df_f3_v1.head()

   posted  item_id  recommend            user_id  sentiment
0    2011     1250          1  76561197970982479        1.0
1    2011    22200          1  76561197970982479        1.0
2    2011    43110          1  76561197970982479        1.0
3    2014   251610          1            js41637        1.0
4    2013   227300          1            js41637       -1.0

In [76]:
# Agrupar por año ('posted') y juego ('item_id'), sumando las columnas 'recommend' y 'sentiment'

grouped = df_f3_v1.groupby(['posted', 'item_id']).agg({'recommend': 'sum', 'sentiment': 'sum'}).reset_index()

# Calcular la suma total de 'recommend' y 'sentiment' para cada juego, ordenar y obtener los tres juegos con mayores sumas

df_f3_v2 = (
    grouped.groupby('posted')
    .apply(lambda x: x.nlargest(3, columns=['recommend', 'sentiment']))
    .reset_index(drop=True)
)

In [77]:
print(len(df_f3_v2))
df_f3_v2.head()

18

   posted  item_id  recommend  sentiment
0    2010      440         10        9.0
1    2010     1250          6        5.0
2    2010      630          4        3.0
3    2011      440         79       36.0
4    2011      620         26       19.0

In [78]:
df_f3_v3 = df_f3_v2.copy()

In [85]:
df_f3_MLM_v1 = pd.read_csv('Data\data_MLM_1.csv')

In [89]:
# Se unen los DataFrames df_sg_anid y df_NPLM_top3 por las columnas id e item_id respectivamente y 
# se filtran df_sg_anid por las filas que coincidan con los valores de item_id en df_NPLM_top3

filtered_df_f3_MLM_v1 = df_f3_MLM_v1[df_f3_MLM_v1['id'].isin(df_f3_v3['item_id'])]

In [90]:
filtered_df_f3_MLM_v1.head()

                              app_name    id
58                         Garry's Mod  4000
441                        Alien Swarm   630
631                           Portal 2   620
1044  Counter-Strike: Global Offensive   730
1461                            Dota 2   570

In [91]:
# Realizar el merge entre df_NPLM_top3 y filtered_df_sg_anid utilizando item_id y id respectivamente

df_final_v1 = pd.merge(df_f3_v3, filtered_df_f3_MLM_v1, left_on='item_id', right_on='id', how='inner')

In [92]:
df_final_v1.head()

   posted  item_id  recommend  sentiment         app_name   id
0    2010      440         10        9.0  Team Fortress 2  440
1    2011      440         79       36.0  Team Fortress 2  440
2    2012      440        268      125.0  Team Fortress 2  440
3    2013      440        798      410.0  Team Fortress 2  440
4    2014      440       1564      710.0  Team Fortress 2  440

In [93]:
print(len(df_final_v1))

18

In [94]:
# Formatear el resultado como texto

result = df_final_v1.groupby('posted').apply(
    lambda x: f"Puesto 1: {x.iloc[0]['app_name']}, Puesto 2: {x.iloc[1]['app_name']}, Puesto 3: {x.iloc[2]['app_name']}, para el año {x.iloc[0]['posted']}"
).reset_index(name='Top 3 Games')

# Convertir a DataFrame

df_final_v2 = pd.DataFrame(result)

In [95]:
df_final_v2.head(10)

   posted                                        Top 3 Games
0    2010  Puesto 1: Team Fortress 2, Puesto 2: Killing F...
1    2011  Puesto 1: Team Fortress 2, Puesto 2: Portal 2,...
2    2012  Puesto 1: Team Fortress 2, Puesto 2: Terraria,...
3    2013  Puesto 1: Team Fortress 2, Puesto 2: Garry's M...
4    2014  Puesto 1: Team Fortress 2, Puesto 2: Garry's M...
5    2015  Puesto 1: Team Fortress 2, Puesto 2: Garry's M...

In [96]:
df_final_v2['Top 3 Games'][0]

'Puesto 1: Team Fortress 2, Puesto 2: Killing Floor, Puesto 3: Alien Swarm, para el año 2010'

In [555]:
df_final_v2.to_csv('Data\Endpoints\Endpoint_3.csv', index=False)

# Endpoint 4

In [97]:
df_f4_v1 = pd.read_csv('Data\data_NLPM_2.csv')

In [98]:
df_f4_v1.head()

   posted  item_id  recommend            user_id  sentiment
0    2011     1250          1  76561197970982479        1.0
1    2011    22200          1  76561197970982479        1.0
2    2011    43110          1  76561197970982479        1.0
3    2014   251610          1            js41637        1.0
4    2013   227300          1            js41637       -1.0

In [99]:
# Lo mismo que en el caso anterior se agrupan por año ('posted') y juego ('item_id'), sumando las columnas 'recommend' y 'sentiment'

f4_agrupado = df_f4_v1.groupby(['posted', 'item_id']).agg({'recommend': 'sum', 'sentiment': 'sum'}).reset_index()

In [100]:
# Se calcula la suma total de 'recommend' y 'sentiment' para cada juego, pero se ordena y obtiene los tres juegos con menores sumas
# cambiando la funcion "nlargest" por "nsmallest".

df_f4_v2 = (
    f4_agrupado.groupby('posted')
    .apply(lambda x: x.nsmallest(3, columns=['recommend', 'sentiment']))
    .reset_index(drop=True)
)

In [101]:
df_f4_v2.head()

   posted  item_id  recommend  sentiment
0    2010     8800          1       -1.0
1    2010    10500          1       -1.0
2    2010    15320          1       -1.0
3    2011    18700          0       -2.0
4    2011    63940          0       -1.0

In [102]:
df_f4_v3 = df_f4_v2.copy()

df_f4_MLM_v1 = pd.read_csv('Data\data_MLM_1.csv')

In [106]:
# Se unen los DataFrames df_f4_MLM_v1 y df_f4_v3 por las columnas id e item_id respectivamente y 
# se filtran df_f4_MLM_v1 por las filas que coincidan con los valores de item_id en df_f4_v3

df_f4_MLM_v1_filtrado = df_f4_MLM_v1[df_f4_MLM_v1['id'].isin(df_f4_v3['item_id'])]

In [107]:
df_f4_MLM_v1_filtrado.head()

                             app_name     id
142              IL-2 Sturmovik: 1946  15320
250                     Port Royale 2  12470
502                The Kings' Crusade  42920
722               Men of War: Vietnam  63940
844  Jagged Alliance - Back in Action  57740

In [108]:
print(len(df_f4_v3))
print(len(df_f4_MLM_v1_filtrado))

18
12

In [109]:
# Realizar el merge entre df_f4_v3 y df_f4_MLM_v1_filtrado utilizando item_id y id respectivamente

df_final_f4_v1 = pd.merge(df_f4_v3, df_f4_MLM_v1_filtrado, left_on='item_id', right_on='id', how='inner')

In [110]:
df_final_f4_v1.head()

,posted,item_id,recommend,sentiment,app_name,id
0,2010,8800,1,-1.0,Civilization IV: Beyond the Sword,8800
1,2010,10500,1,-1.0,Empire: Total War™,10500
2,2010,15320,1,-1.0,IL-2 Sturmovik: 1946,15320
3,2011,18700,0,-2.0,And Yet It Moves,18700
4,2011,63940,0,-1.0,Men of War: Vietnam,63940

In [111]:
print(len(df_final_f4_v1))

12

In [112]:
df_final_f4_v2 = pd.merge(df_f4_v3, df_final_f4_v1, on='item_id', how='outer')

In [113]:
print(len(df_final_f4_v2))
df_final_f4_v2.head(5)

18

,posted_x,item_id,recommend_x,sentiment_x,posted_y,recommend_y,sentiment_y,app_name,id
0,2010,8800,1,-1.0,2010.0,1.0,-1.0,Civilization IV: Beyond the Sword,8800.0
1,2010,10500,1,-1.0,2010.0,1.0,-1.0,Empire: Total War™,10500.0
2,2010,15320,1,-1.0,2010.0,1.0,-1.0,IL-2 Sturmovik: 1946,15320.0
3,2011,18700,0,-2.0,2011.0,0.0,-2.0,And Yet It Moves,18700.0
4,2011,63940,0,-1.0,2011.0,0.0,-1.0,Men of War: Vietnam,63940.0

In [114]:
df_final_f4_v3 = df_final_f4_v2.drop(['recommend_x', 'recommend_y','sentiment_x','sentiment_y','posted_y','id'], axis=1)

In [115]:
df_final_f4_v3.columns

Index(['posted_x', 'item_id', 'app_name'], dtype='object')

In [116]:
df_final_f4_v4 = df_final_f4_v3.copy()

# Reemplazar los valores nulos en 'app_name' con el string deseado
df_final_f4_v4['app_name'] = df_final_f4_v4['app_name'].fillna("Steam Greenlight N " + df_final_f4_v4['item_id'].astype(str))

In [117]:
df_final_f4_v4.head(20)

    posted_x  item_id                               app_name
0       2010     8800      Civilization IV: Beyond the Sword
1       2010    10500                     Empire: Total War™
2       2010    15320                   IL-2 Sturmovik: 1946
3       2011    18700                       And Yet It Moves
4       2011    63940                    Men of War: Vietnam
5       2011    24500               Steam Greenlight N 24500
6       2012    42920                     The Kings' Crusade
7       2012   209100  Resident Evil: Operation Raccoon City
8       2012    57740       Jagged Alliance - Back in Action
9       2013     1670     Iron Warriors: T - 72 Tank Command
10      2013    12470                          Port Royale 2
11      2013    17020               Steam Greenlight N 17020
12      2014   220050              Steam Greenlight N 220050
13      2015   220050              Steam Greenlight N 220050
14      2014     2870                              X Rebirth
15      2014    96300               Steam Greenlight N 96300
16      2015   331710              Steam Greenlight N 331710
17      2015   370240                               NBA 2K16

In [118]:
# Formatear el resultado como texto

result_v2 = df_final_f4_v4.groupby('posted_x').apply(
    lambda x: f"Puesto 1: {x.iloc[0]['app_name']}, Puesto 2: {x.iloc[1]['app_name']}, Puesto 3: {x.iloc[2]['app_name']}, para el año {x.iloc[0]['posted_x']}"
).reset_index(name='Worst 3 Games')

# Convertir a DataFrame

df_final_f4_v5 = pd.DataFrame(result_v2)

In [119]:
df_final_f4_v5.head(20)

   posted_x                                      Worst 3 Games
0      2010  Puesto 1: Civilization IV: Beyond the Sword, P...
1      2011  Puesto 1: And Yet It Moves, Puesto 2: Men of W...
2      2012  Puesto 1: The Kings' Crusade, Puesto 2: Reside...
3      2013  Puesto 1: Iron Warriors: T - 72 Tank Command, ...
4      2014  Puesto 1: Steam Greenlight N 220050, Puesto 2:...
5      2015  Puesto 1: Steam Greenlight N 220050, Puesto 2:...

In [120]:
df_final_f4_v5['Worst 3 Games'][0]

'Puesto 1: Civilization IV: Beyond the Sword, Puesto 2: Empire: Total War™, Puesto 3: IL-2 Sturmovik: 1946, para el año 2010'

In [250]:
df_final_f4_v5.to_csv('Data\Endpoints\Endpoint_4.csv', index=False)

# Endpoint 5

In [121]:
df_f5_v1 = pd.read_csv('Data\data_NLPM_2.csv')
df_sf5_v1 = pd.read_csv('Data\data_Steam_2.csv')

In [122]:
print(len(df_f5_v1))
df_f5_v1.head()

49186

   posted  item_id  recommend            user_id  sentiment
0    2011     1250          1  76561197970982479        1.0
1    2011    22200          1  76561197970982479        1.0
2    2011    43110          1  76561197970982479        1.0
3    2014   251610          1            js41637        1.0
4    2013   227300          1            js41637       -1.0

In [123]:
print(len(df_sf5_v1))
df_sf5_v1.head()

27656

   release_date  price      id            developer
0          2018   4.99  761140            Kotoshiro
1          2018   0.00  643980     Secret Level SRL
2          2017   0.00  670290         Poolians.com
3          2017   0.99  767400                 彼岸领域
4          2018   3.99  772540  Trickjump Games Ltd

In [124]:
df_f5_v2 = df_f5_v1.drop(['posted', 'recommend','user_id'], axis=1)

df_sf5_v2 = df_sf5_v1.drop(['release_date', 'price'], axis=1)

In [125]:
df_sf5_v2 = df_sf5_v2.rename(columns={'id': 'item_id'})

In [126]:
print(df_f5_v2.columns)
print(df_sf5_v2.columns)

Index(['item_id', 'sentiment'], dtype='object')
Index(['item_id', 'developer'], dtype='object')

In [127]:
df_final_f5 = pd.merge(df_f5_v2, df_sf5_v2, on='item_id', how='inner')

In [128]:
print(len(df_final_f5))
print(df_final_f5.isnull().sum())
df_final_f5.head()

41059
item_id      0
sentiment    0
developer    0
dtype: int64

   item_id  sentiment             developer
0     1250        1.0  Tripwire Interactive
1     1250        1.0  Tripwire Interactive
2     1250        1.0  Tripwire Interactive
3     1250        0.0  Tripwire Interactive
4     1250        0.0  Tripwire Interactive

In [129]:
df_final_f5 = df_final_f5.drop(['item_id'], axis=1)

df_final_f5['sentiment'].astype(int)

0        1
1        1
2        1
3        0
4        0
        ..
41054   -1
41055    1
41056   -1
41057    1
41058    1
Name: sentiment, Length: 41059, dtype: int32

In [130]:
# Crear una tabla pivote para obtener la suma de 'sentiment' por 'developer'
df_final_f5_v2 = df_final_f5.pivot_table(index='developer', columns='sentiment', aggfunc='size', fill_value=0)

# Renombrar las columnas
df_final_f5_v2.columns = ['Neutrales', 'Positivos', 'Negativos']

# Resetear el índice para tener 'developer' como una columna
df_final_f5_v2.reset_index(inplace=True)

In [131]:
print(len(df_final_f5_v2))
print(df_final_f5_v2.isnull().sum())
df_final_f5_v2.head()

1653
developer    0
Neutrales    0
Positivos    0
Negativos    0
dtype: int64

                               developer  Neutrales  Positivos  Negativos
0                         07th Expansion          1          1          0
1  10th Art Studio,Adventure Productions          0          1          1
2                         11 bit studios         17          7         22
3                               14° East          1          0          1
4                                 17-BIT          1          0          1

In [132]:
# Formatear el resultado como texto

result_f5_v2 = df_final_f5_v2.groupby('developer').apply(
    lambda x: f"{x.iloc[0]['developer']} : Negative = {x.iloc[0]['Negativos']}, Neutral = {x.iloc[0]['Neutrales']}, Positive = {x.iloc[0]['Positivos']}"
).reset_index(name='mensaje')

# Convertir a DataFrame

df_final_f5_v3 = pd.DataFrame(result_f5_v2)

In [133]:
print(len(df_final_f5_v3))
print(df_final_f5_v3.isnull().sum())
df_final_f5_v3.head()

1653
developer    0
mensaje      0
dtype: int64

,developer,mensaje
0,07th Expansion,"07th Expansion : Negative = 0, Neutral = 1, Po..."
1,"10th Art Studio,Adventure Productions","10th Art Studio,Adventure Productions : Negati..."
2,11 bit studios,"11 bit studios : Negative = 22, Neutral = 17, ..."
3,14° East,"14° East : Negative = 1, Neutral = 1, Positive..."
4,17-BIT,"17-BIT : Negative = 1, Neutral = 1, Positive = 0"

In [313]:
df_final_f5_v3.to_csv('Data\Endpoints\Endpoint_5.csv', index=False)